18549-Team10/549-cc3200/main.c
//*****************************************************************************
//
// Copyright (C) 2014 Texas Instruments Incorporated - http://www.ti.com/ 
// 
// 
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//    Redistributions of source code must retain the above copyright 
//    notice, this list of conditions and the following disclaimer.
//
//    Redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the 
//    documentation and/or other materials provided with the   
//    distribution.
//
//    Neither the name of Texas Instruments Incorporated nor the names of
//    its contributors may be used to endorse or promote products derived
//    from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************


//*****************************************************************************
//
// Application Name     - UDP Socket
// Application Overview - This particular application illustrates how this
//                        device can be used as a client or server for UDP
//                        communication.
// Application Details  -
// http://processors.wiki.ti.com/index.php/CC32xx_UDP_Socket_Application
// or
// docs\examples\CC32xx_UDP_Socket_Application.pdf
//
//*****************************************************************************


//****************************************************************************
//
//! \addtogroup udp_socket
//! @{
//
//****************************************************************************

#include <stdlib.h>
#include <string.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>

// simplelink includes
#include "simplelink.h"
#include "wlan.h"

// driverlib includes
#include "hw_ints.h"
#include "hw_types.h"
#include "hw_common_reg.h"
#include "hw_memmap.h"
#include "gpio.h"
#include "hw_adc.h"
#include "hw_gprcm.h"
#include "hw_apps_rcm.h"
#include "timer.h"
#include "pin.h"
#include "adc.h"
#include "rom.h"
#include "rom_map.h"
#include "interrupt.h"
#include "prcm.h"
#include "utils.h"
#include "uart.h"
#include "adc_userinput.h"

// common interface includes
#include "udma_if.h"
#include "common.h"
#ifndef NOTERM
#include "uart_if.h"
#endif

#include "pinmux.h"


#define APPLICATION_NAME        "UDP Socket"
#define APPLICATION_VERSION     "1.1.1"

//#define IP_ADDR            0xc0a8006E /* 192.168.0.110 */
#define IP_ADDR            	0x2d378e9c /* 45.55.142.156 */
//#define IP_ADDR2            	0x /* 128.237.218.69 */


#define PORT_NUM           41234
#define BUF_SIZE           1400
#define UDP_PACKET_COUNT   1
#define TRANSFER_SAMPLES 	256
#define HEADER_SIZE 			12

//*********** adc *********
#define USER_INPUT
#define UART_PRINT         Report
#define NO_OF_SAMPLES 		1024
#define ADC_BUF_SIZE         4096
#define ADC_SKIP_AMT         4
unsigned long pulAdcSamples[ADC_BUF_SIZE];

// Application specific status/error codes
typedef enum{
    // Choosing -0x7D0 to avoid overlap w/ host-driver's error codes
    SOCKET_CREATE_ERROR = -0x7D0,
    BIND_ERROR = SOCKET_CREATE_ERROR - 1,
    SEND_ERROR = BIND_ERROR - 1,
    RECV_ERROR = SEND_ERROR -1,
    SOCKET_CLOSE = RECV_ERROR -1,  
    DEVICE_NOT_IN_STATION_MODE = SOCKET_CLOSE - 1,
    STATUS_CODE_MAX = -0xBB8
}e_AppStatusCodes;

//
// The PWM works based on the following settings:
//     Timer reload interval -> determines the time period of one cycle
//     Timer match value -> determines the duty cycle
//                          range [0, timer reload interval]
// The computation of the timer reload interval and dutycycle granularity
// is as described below:
// Timer tick frequency = 80 Mhz = 80000000 cycles/sec
// For a time period of 0.5 ms,
//      Timer reload interval = 80000000/2000 = 40000 cycles
// To support steps of duty cycle update from [0, 255]
//      duty cycle granularity = ceil(40000/255) = 157
// Based on duty cycle granularity,
//      New Timer reload interval = 255*157 = 40035
//      New time period = 0.5004375 ms
//      Timer match value = (update[0, 255] * duty cycle granularity)
//
//#define TIMER_INTERVAL_RELOAD   40035 /* =(255*157) */
//#define DUTYCYCLE_GRANULARITY   157
#define FREQUENCY_SWEEPS			5
#define FREQUENCIES   		 	{ 10000, 9000, 8000, 7000, 6000 }
#define TIMER_INTERVAL_RELOAD   { 7905, 8925, 9945, 11475, 13260 }
#define DUTYCYCLE_GRANULARITY   { 31, 35, 39, 45, 52 }
#define DUTY_CYCLE				128 /*[0,255]*/

#define NUMBER_TRAINING_TESTS 100
#define NUMBER_CLASSIFY_TESTS 8

#define FILL_GRANULARITY 5

typedef enum {EMPTY, QUARTER, HALF, THREE_QUARTER, FULL, UNKNOWN} fillLevel_t;


//****************************************************************************
//                      LOCAL FUNCTION PROTOTYPES
//****************************************************************************

void InitPWMModules(unsigned long timerInterval);
void DeInitPWMModules(void);
void SetupTimerPWMMode(unsigned long ulBase, unsigned long ulTimer,
                       unsigned long ulConfig, unsigned char ucInvert,
					   unsigned long timerInterval);
void UpdateDutyCycle(unsigned long ulBase, unsigned long ulTimer,
                     unsigned long dutycycleGranularity);

