18549-Team10/549-cc3200/main.c
    // Remove all profiles
    lRetVal = sl_WlanProfileDel(0xFF);
    ASSERT_ON_ERROR(lRetVal);

    

    //
    // Device in station-mode. Disconnect previous connection if any
    // The function returns 0 if 'Disconnected done', negative number if already
    // disconnected Wait for 'disconnection' event if 0 is returned, Ignore 
    // other return-codes
    //
    lRetVal = sl_WlanDisconnect();
    if(0 == lRetVal)
    {
        // Wait
        while(IS_CONNECTED(g_ulStatus))
        {
#ifndef SL_PLATFORM_MULTI_THREADED
              _SlNonOsMainLoopTask(); 
#endif
        }
    }

    // Enable DHCP client
    lRetVal = sl_NetCfgSet(SL_IPV4_STA_P2P_CL_DHCP_ENABLE,1,1,&ucVal);
    ASSERT_ON_ERROR(lRetVal);

    // Disable scan
    ucConfigOpt = SL_SCAN_POLICY(0);
    lRetVal = sl_WlanPolicySet(SL_POLICY_SCAN , ucConfigOpt, NULL, 0);
    ASSERT_ON_ERROR(lRetVal);

    // Set Tx power level for station mode
    // Number between 0-15, as dB offset from max power - 0 will set max power
    ucPower = 0;
    lRetVal = sl_WlanSet(SL_WLAN_CFG_GENERAL_PARAM_ID, 
            WLAN_GENERAL_PARAM_OPT_STA_TX_POWER, 1, (unsigned char *)&ucPower);
    ASSERT_ON_ERROR(lRetVal);

    // Set PM policy to normal
    lRetVal = sl_WlanPolicySet(SL_POLICY_PM , SL_NORMAL_POLICY, NULL, 0);
    ASSERT_ON_ERROR(lRetVal);

    // Unregister mDNS services
    lRetVal = sl_NetAppMDNSUnRegisterService(0, 0);
    ASSERT_ON_ERROR(lRetVal);

    // Remove  all 64 filters (8*8)
    memset(RxFilterIdMask.FilterIdMask, 0xFF, 8);
    lRetVal = sl_WlanRxFilterSet(SL_REMOVE_RX_FILTER, (_u8 *)&RxFilterIdMask,
                       sizeof(_WlanRxFilterOperationCommandBuff_t));
    ASSERT_ON_ERROR(lRetVal);

    lRetVal = sl_Stop(SL_STOP_TIMEOUT);
    ASSERT_ON_ERROR(lRetVal);

    InitializeAppVariables();
    
    return lRetVal; // Success
}

//****************************************************************************
//
//!    \brief Parse the input IP address from the user
//!
//!    \param[in]                     ucCMD (char pointer to input string)
//!
//!    \return                        0 : if correct IP, -1 : incorrect IP
//
//****************************************************************************
int IpAddressParser(char *ucCMD)
{
    int i=0;
    unsigned int uiUserInputData;
    unsigned long ulUserIpAddress = 0;
    char *ucInpString;
    ucInpString = strtok(ucCMD, ".");
    uiUserInputData = (int)strtoul(ucInpString,0,10);
    while(i<4)
    {
        //
       // Check Whether IP is valid
       //
       if((ucInpString != NULL) && (uiUserInputData < 256))
       {
           ulUserIpAddress |= uiUserInputData;
           if(i < 3)
               ulUserIpAddress = ulUserIpAddress << 8;
           ucInpString=strtok(NULL,".");
           uiUserInputData = (int)strtoul(ucInpString,0,10);
           i++;
       }
       else
       {
           return -1;
       }
    }
    g_ulDestinationIp = ulUserIpAddress;
    return SUCCESS;
}

int fillToInt(fillLevel_t toTranslate)
{
	switch(toTranslate)
	{
	case EMPTY:
		return 1;
	case QUARTER:
		return 2;
	case HALF:
		return 3;
	case THREE_QUARTER:
		return 4;
	case FULL:
		return 5;
	case UNKNOWN:
		return 6;
	}
	return 6;
}

fillLevel_t intToFill(int toTranslate)
{
	switch(toTranslate)
	{
	case 1:
		return EMPTY;
	case 2:
		return QUARTER;
	case 3:
		return HALF;
	case 4:
		return THREE_QUARTER;
	case 5:
		return FULL;
	case 6:
		return UNKNOWN;
	}
	return UNKNOWN;
}

//*****************************************************************************
//
//! UserInput
//!
//! This function
//!        1. Function for reading the user input for UDP RX/TX
//!
//! \return none
//
//*****************************************************************************
long UserInput(void)
{
	fillLevel_t fillLevel;
	int sweep;
    int iInput = 2;
    char acCmdStore[50];
    int lRetVal;
    int iterations;
    int totalIterations;

    UART_PRINT("Default settings: SSID Name: %s, PORT = %d, Packet Count = %d, "
                  "Destination IP: %d.%d.%d.%d\n\r",
            SSID_NAME, g_uiPortNum, g_ulPacketCount,
            SL_IPV4_BYTE(g_ulDestinationIp,3),
            SL_IPV4_BYTE(g_ulDestinationIp,2),
            SL_IPV4_BYTE(g_ulDestinationIp,1),
            SL_IPV4_BYTE(g_ulDestinationIp,0));

    do{
    		if(buttonPressed)
    		{
    			fillLevel = UNKNOWN;
    			buttonPressed = FALSE;
    			totalIterations = NUMBER_CLASSIFY_TESTS;

        		for(iterations = 0; iterations < totalIterations; iterations++)
        		{
        			for(sweep = 0; sweep < FREQUENCY_SWEEPS; sweep++)
        			{
        				//
        				// Initialize the PWMs used for driving the LEDs
        				//
        				InitPWMModules(g_timerInterval[sweep]);
        				UpdateDutyCycle(TIMERA3_BASE, TIMER_A, g_dutycycleGranularity[sweep]);

        				MAP_UtilsDelay(8000000);
        				readAdc();
        				DeInitPWMModules();

        				transferData(g_frequencies[sweep], fillLevel);
        			}
        		}
        		//Enable GPIO Interrupt
        		Button_EnableInterrupt();
    		}
    }while(1);

    do
    {
        UART_PRINT("\r\nOptions:\r\n1. Empty \r\n2. Quarter \r\n"
                    "3. Half\r\n4. Three Quarters \r\n5. Full\r\n"
                    "6. Unknown\r\n");
        UART_PRINT("Enter the option to use: ");
        lRetVal = GetCmd(acCmdStore, sizeof(acCmdStore));
        if(lRetVal == 0 || lRetVal > FILL_GRANULARITY)
        {
          //
          // No input. Just an enter pressed probably. Display a prompt.
          //
          UART_PRINT("\n\n\rEnter Valid Input.");
        }
        else
        {
        		iInput  = (int)strtoul(acCmdStore,0,10);
        		fillLevel = intToFill(iInput);

        		if(fillLevel == UNKNOWN)
        			totalIterations = NUMBER_CLASSIFY_TESTS;
        		else
        			totalIterations = NUMBER_TRAINING_TESTS;

