18549-Team10/549-cc3200/main.c
        		for(iterations = 0; iterations < totalIterations; iterations++)
        		{
        			for(sweep = 0; sweep < FREQUENCY_SWEEPS; sweep++)
        			{
        				//
        				// Initialize the PWMs used for driving the LEDs
        				//
        				InitPWMModules(g_timerInterval[sweep]);
        				UpdateDutyCycle(TIMERA3_BASE, TIMER_A, g_dutycycleGranularity[sweep]);

        				MAP_UtilsDelay(8000000);
        				readAdc();
        				DeInitPWMModules();

        				transferData(g_frequencies[sweep], fillLevel);
        			}
        		}

        }
        UART_PRINT("\n\r");
    }while(1);

    return 0;

}

void Button_EnableInterrupt()
{
	//Enable GPIO Interrupt
	MAP_GPIOIntClear(GPIOA1_BASE,GPIO_PIN_5);
	MAP_IntPendClear(INT_GPIOA1);
	MAP_IntEnable(INT_GPIOA1);
	MAP_GPIOIntEnable(GPIOA1_BASE,GPIO_PIN_5);
}

void Button_DisableInterrupt()
{
	//Clear and Disable GPIO Interrupt
	MAP_GPIOIntDisable(GPIOA1_BASE,GPIO_PIN_5);
	MAP_GPIOIntClear(GPIOA1_BASE,GPIO_PIN_5);
	MAP_IntDisable(INT_GPIOA1);
}

void Button_Init()
{
//	MAP_PinTypeGPIO(PIN_04, PIN_MODE_0, false);               //Set GPIO[13] to GPIO Mode
//	MAP_GPIODirModeSet(GPIOA1_BASE, 0x20, GPIO_DIR_MODE_IN);  //Set GPIO[13] to Input

	//
	// Set Interrupt Type for GPIO
	//
	MAP_GPIOIntTypeSet(GPIOA1_BASE,GPIO_PIN_5,GPIO_FALLING_EDGE);

	//
	// Register Interrupt handler
	//
#if defined(USE_TIRTOS) || defined(USE_FREERTOS) || defined(SL_PLATFORM_MULTI_THREADED)
	// USE_TIRTOS: if app uses TI-RTOS (either networking/non-networking)
	// USE_FREERTOS: if app uses Free-RTOS (either networking/non-networking)
	// SL_PLATFORM_MULTI_THREADED: if app uses any OS + networking(simplelink)
	osi_InterruptRegister(INT_GPIOA1,(P_OSI_INTR_ENTRY)setButtonTrue, \
			INT_PRIORITY_LVL_1);
#else
	MAP_IntPrioritySet(INT_GPIOA1, INT_PRIORITY_LVL_1);
	MAP_GPIOIntRegister(GPIOA1_BASE, setButtonTrue);
#endif
	//
	// Enable Interrupt
	//
	MAP_GPIOIntClear(GPIOA1_BASE,GPIO_PIN_5);
	MAP_GPIOIntEnable(GPIOA1_BASE,GPIO_INT_PIN_5);
}

void setButtonTrue()
{
    unsigned long ulPinState =  GPIOIntStatus(GPIOA1_BASE,1);

    if(ulPinState & GPIO_PIN_5)
    {
        Button_DisableInterrupt();
    		buttonPressed = TRUE;
    }
}


//****************************************************************************
//
//! \brief Opening a UDP client side socket and sending data
//!
//! This function opens a UDP socket and tries to connect to a Server IP_ADDR
//!    waiting on port PORT_NUM.
//!    Then the function will send UDP_PACKET_COUNT UDP packets to the server.
//!
//! \param[in]  port number on which the server will be listening on
//!
//! \return    0 on success, -1 on Error.
//
//****************************************************************************
int BsdUdpClient(unsigned short usPort, short sTestBufLen, char *buffer)
{
    SlSockAddrIn_t  sAddr;
    int             iAddrSize;
    int             iSockID;
    int             iStatus;
    long            lLoopCount = 0;
    int 				iCounter;

    //filling the UDP server socket address
    sAddr.sin_family = SL_AF_INET;
    sAddr.sin_port = sl_Htons((unsigned short)usPort);
    sAddr.sin_addr.s_addr = sl_Htonl((unsigned int)g_ulDestinationIp);

    iAddrSize = sizeof(SlSockAddrIn_t);

    // creating a UDP socket
    iSockID = sl_Socket(SL_AF_INET,SL_SOCK_DGRAM, 0);
    if( iSockID < 0 )
    {
        // error
        ASSERT_ON_ERROR(SOCKET_CREATE_ERROR);
    }


//    for (iCounter=0 ; iCounter < sTestBufLen; iCounter++)
//    {
//    		UART_PRINT("%x",buffer[iCounter] & 0xFF);
//    }
//    	UART_PRINT("\n\r");

    // for a UDP connection connect is not required
    // sending UDP_PACKET_COUNT packets to the UDP server
    while (lLoopCount < g_ulPacketCount)
    {
        // sending packet
        iStatus = sl_SendTo(iSockID, buffer, sTestBufLen, 0,
                                (SlSockAddr_t *)&sAddr, iAddrSize);
        if( iStatus <= 0 )
        {
            // error
            sl_Close(iSockID);
            ASSERT_ON_ERROR(SEND_ERROR);
        }
        lLoopCount++;
    }

    UART_PRINT("Sent %u packets successfully\n\r",g_ulPacketCount);

    //closing the socket after sending UDP_PACKET_COUNT packets
    sl_Close(iSockID);

    return SUCCESS;
}

//****************************************************************************
//
//!  \brief Connecting to a WLAN Accesspoint
//!
//!   This function connects to the required AP (SSID_NAME) with Security
//!   parameters specified in te form of macros at the top of this file
//!
//!   \param[in]              None
//!
//!   \return       status value
//!
//!   \warning    If the WLAN connection fails or we don't aquire an IP
//!            address, It will be stuck in this function forever.
//
//****************************************************************************
static long WlanConnect()
{
    SlSecParams_t secParams = {0};
    long lRetVal = 0;

    secParams.Key = (signed char*)SECURITY_KEY;
    secParams.KeyLen = strlen(SECURITY_KEY);
    secParams.Type = SECURITY_TYPE;

    lRetVal = sl_WlanConnect((signed char*)SSID_NAME, strlen(SSID_NAME), 0, \
                                    &secParams, 0);
    ASSERT_ON_ERROR(lRetVal);

    while((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus)))
    {
        // Wait for WLAN Event
#ifndef SL_PLATFORM_MULTI_THREADED
        _SlNonOsMainLoopTask();
#endif
      
    }

    return SUCCESS;
}

//****************************************************************************
//
//! Update the dutycycle of the PWM timer
//!
//! \param ulBase is the base address of the timer to be configured
//! \param ulTimer is the timer to be setup (TIMER_A or  TIMER_B)
//! \param ucLevel translates to duty cycle settings (0:255)
//!
//! This function
//!    1. The specified timer is setup to operate as PWM
//!
//! \return None.
//
//****************************************************************************
void UpdateDutyCycle(unsigned long ulBase, unsigned long ulTimer,
                     unsigned long dutycycleGranularity)
{
    //
    // Match value is updated to reflect the new dutycycle settings
    //
    MAP_TimerMatchSet(ulBase,ulTimer,(DUTY_CYCLE*dutycycleGranularity));
}

//****************************************************************************
//
//! Setup the timer in PWM mode
//!
//! \param ulBase is the base address of the timer to be configured
//! \param ulTimer is the timer to be setup (TIMER_A or  TIMER_B)
//! \param ulConfig is the timer configuration setting
//! \param ucInvert is to select the inversion of the output
//!
//! This function
//!    1. The specified timer is setup to operate as PWM
//!
//! \return None.
//
//****************************************************************************
void SetupTimerPWMMode(unsigned long ulBase, unsigned long ulTimer,
                       unsigned long ulConfig, unsigned char ucInvert,
					   unsigned long timerInterval)
{
    //
    // Set GPT - Configured Timer in PWM mode.
    //
    MAP_TimerConfigure(ulBase,ulConfig);
    MAP_TimerPrescaleSet(ulBase,ulTimer,0);

    //
    // Inverting the timer output if required
    //
    MAP_TimerControlLevel(ulBase,ulTimer,ucInvert);

    //
    // Load value set to ~0.5 ms time period
    //
    MAP_TimerLoadSet(ulBase,ulTimer,timerInterval);

    //
    // Match value set so as to output level 0
    //
    MAP_TimerMatchSet(ulBase,ulTimer,timerInterval);

