18549-Team10/549-cc3200/main.c
}

//****************************************************************************
//
//! Sets up the identified timers as PWM to drive the peripherals
//!
//! \param none
//!
//! This function sets up the folowing
//!    1. TIMERA2 (TIMER B) as RED of RGB light
//!    2. TIMERA3 (TIMER B) as YELLOW of RGB light
//!    3. TIMERA3 (TIMER A) as GREEN of RGB light
//!
//! \return None.
//
//****************************************************************************
void InitPWMModules(unsigned long timerInterval)
{
    //
    // Initialization of timers to generate PWM output
    //
    MAP_PRCMPeripheralClkEnable(PRCM_TIMERA3, PRCM_RUN_MODE_CLK);

    //
    // TIMERA3 (TIMER B) as YELLOW of RGB light. GPIO 10 --> PWM_6
    //
    SetupTimerPWMMode(TIMERA3_BASE, TIMER_A,
            (TIMER_CFG_SPLIT_PAIR | TIMER_CFG_A_PWM | TIMER_CFG_B_PWM), 1,
			timerInterval );

    MAP_TimerEnable(TIMERA3_BASE,TIMER_A);
}

//****************************************************************************
//
//! Disables the timer PWMs
//!
//! \param none
//!
//! This function disables the timers used
//!
//! \return None.
//
//****************************************************************************
void DeInitPWMModules(void)
{
    //
    // Disable the peripherals
    //
    MAP_TimerDisable(TIMERA3_BASE, TIMER_A);
    //MAP_PRCMPeripheralClkDisable(PRCM_TIMERA3, PRCM_RUN_MODE_CLK);
}

//*****************************************************************************
//
//! Application startup display on UART
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void
DisplayBanner(char * AppName)
{
    UART_PRINT("\n\n\n\r");
    UART_PRINT("\t\t *************************************************\n\r");
    UART_PRINT("\t\t      CC3200 %s Application       \n\r", AppName);
    UART_PRINT("\t\t *************************************************\n\r");
    UART_PRINT("\n\n\n\r");
}

//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void
BoardInit(void)
{
/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
  //
  // Set vector table base
  //
#if defined(ccs) || defined(gcc)
    MAP_IntVTableBaseSet((unsigned long)&g_pfnVectors[0]);
#endif
#if defined(ewarm)
    MAP_IntVTableBaseSet((unsigned long)&__vector_table);
#endif
#endif
    //
    // Enable Processor
    //
    MAP_IntMasterEnable();
    MAP_IntEnable(FAULT_SYSTICK);

    PRCMCC3200MCUInit();
}

void readAdc(void)
{
	unsigned int  uiChannel;
	unsigned int  uiIndex=0;
	unsigned long ulSample;
	float total=0;
	float average=0;

	//
	// Pinmux for the selected ADC input pin
	//
	MAP_PinTypeADC(PIN_58,PIN_MODE_255);

	//Can be Pin_58 -> CH1, 59 -> CH2, 60 -> CH3
	uiChannel = ADC_CH_1;

	//
	// Configure ADC timer which is used to timestamp the ADC data samples
	//
	MAP_ADCTimerConfig(ADC_BASE,2^17);

	//
	// Enable ADC timer which is used to timestamp the ADC data samples
	//
	MAP_ADCTimerEnable(ADC_BASE);

	//
	// Enable ADC module
	//
	MAP_ADCEnable(ADC_BASE);

	//
	// Enable ADC channel
	//

	MAP_ADCChannelEnable(ADC_BASE, uiChannel);
	uiIndex=0;

	while(uiIndex < NO_OF_SAMPLES + ADC_SKIP_AMT)
	{
		//Checks if next value available
		if(MAP_ADCFIFOLvlGet(ADC_BASE, uiChannel))
		{
			ulSample = MAP_ADCFIFORead(ADC_BASE, uiChannel);
			pulAdcSamples[uiIndex++] = ulSample;
		}
	}

	MAP_ADCChannelDisable(ADC_BASE, uiChannel);



	for(uiIndex = 0; uiIndex < NO_OF_SAMPLES; uiIndex++)
	{
		///Calculations
//		UART_PRINT("Voltage is %lu(%x) = %f\n\r",
//				pulAdcSamples[ADC_SKIP_AMT+uiIndex],
//				pulAdcSamples[ADC_SKIP_AMT+uiIndex],
//				(((float)((pulAdcSamples[ADC_SKIP_AMT+uiIndex] >> 2 ) & 0x0FFF))*1.4)/4096);
		total += (((float)((pulAdcSamples[ADC_SKIP_AMT+uiIndex] >> 2 ) & 0x0FFF))*1.4)/4096;
	}
	average = total / NO_OF_SAMPLES;
	UART_PRINT("\n\rTotal is is %f\n\r",(total));
	UART_PRINT("Average is is %f\n\r",(average));
	UART_PRINT("\n\r");
}

void transferData(int frequency, fillLevel_t fillLevel)
{
    int iCounter;
    int lRetVal;
    int transferChunk;
    int transferChunks = NO_OF_SAMPLES/TRANSFER_SAMPLES + (NO_OF_SAMPLES % TRANSFER_SAMPLES != 0 ? 1 : 0);
	int transferLength;

	// filling the udp buffer with ADC
	transferLength = HEADER_SIZE + TRANSFER_SAMPLES * sizeof(pulAdcSamples[0]);
	for(transferChunk = 0; transferChunk < transferChunks; transferChunk++)
	{
		((int *)g_cBsdBuf)[0] = frequency;
		((int *)g_cBsdBuf)[1] = transferChunk;
		((int *)g_cBsdBuf)[2] = fillToInt(fillLevel);

		for (iCounter=0 ; iCounter < transferLength; iCounter++)
		{
			g_cBsdBuf[iCounter + HEADER_SIZE] =
					((char *)(pulAdcSamples + ADC_SKIP_AMT + TRANSFER_SAMPLES * transferChunk))[iCounter];
		}

		UART_PRINT("Sending UDP packets...\n\r");

		// Before proceeding, please make sure to have a server
		// waiting on PORT_NUM
		lRetVal = BsdUdpClient(g_uiPortNum, transferLength, g_cBsdBuf);
		ASSERT_ON_ERROR(lRetVal);
	}
}

//****************************************************************************
//                            MAIN FUNCTION
//****************************************************************************
void main()
{

    long lRetVal = -1;

    //
    // Board Initialization
    //
    BoardInit();

    //
    // uDMA Initialization
    //
    UDMAInit();

    //
    // Configure the pinmux settings for the peripherals exercised
    //
    PinMuxConfig();

    //
    // Configuring UART
    //
    InitTerm();

    //
    // Display banner
    //
    DisplayBanner(APPLICATION_NAME);

    InitializeAppVariables();

    //
    // Following function configure the device to default state by cleaning
    // the persistent settings stored in NVMEM (viz. connection profiles &
    // policies, power policy etc)
    //
    // Applications may choose to skip this step if the developer is sure
    // that the device is in its desired state at start of applicaton
    //
    // Note that all profiles and persistent settings that were done on the
    // device will be lost
    //
    lRetVal = ConfigureSimpleLinkToDefaultState();

    if(lRetVal < 0)
    {
        if (DEVICE_NOT_IN_STATION_MODE == lRetVal)
          UART_PRINT("Failed to configure the device in its default state \n\r");

